## Pandas Tutorial_part1
*This pandas tutorial will cover some basic of pandas commonds, and some basic visualization...*

To know on advanced level then go and check **pandas documentation**...

In [3]:
import pandas as pd

In [15]:
df=pd.read_csv("C:\\Users\\Habib\\PycharmProjects\\pandas\\nyc_weather.csv")
df.head(5)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [7]:
df["Temperature"].max()

50

In [8]:
df["EST"][df["Events"]=="Rain"]

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [18]:
df.fillna(0, inplace=True)

In [20]:
df.head(3)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,0,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,0,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,0,277

In [12]:
df["WindSpeedMPH"].mean()

6.225806451612903

In [13]:
df["WindSpeedMPH"][df["Events"]=="Rain"]

8     8.0
9     0.0
15    7.0
26    7.0
Name: WindSpeedMPH, dtype: float64

In [21]:
df1 = pd.read_csv("C:\\Users\\Habib\\PycharmProjects\\pandas\\weather_data.csv")
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [26]:
df1["temperature"].min()

24

In [27]:
df1["temperature"].max()

35

In [28]:
df1["temperature"].mean()

30.333333333333332

In [29]:
df1["day"][df1["event"]=="Snow"]

2    1/3/2017
3    1/4/2017
Name: day, dtype: object

In [30]:
df1["event"][df1["day"]=="1/2/2017"]

1    Sunny
Name: event, dtype: object

In [31]:
df1["event"][df1["day"]=="1/2/2017"], df1["temperature"][df1["day"]=="1/2/2017"]

(1    Sunny
 Name: event, dtype: object,
 1    35
 Name: temperature, dtype: int64)

In [97]:
# We can pass our own dictionary to pandas DataFrame.
weather_data = {
    'day': ['1/1/2018','1/2/2018','1/3/2017','1/4/2018','1/5/2018','1/6/2018'],
    'temperature': [22,25,32,29,30,27],
    'windspeed': [6,7,2,7,4,2],
    'event': ['Rain', 'Snow', 'Sunny','Sunny','Sunny', 'Snow']
}
df3 = pd.DataFrame(weather_data)
df3

        day  temperature  windspeed  event
0  1/1/2018           22          6   Rain
1  1/2/2018           25          7   Snow
2  1/3/2017           32          2  Sunny
3  1/4/2018           29          7  Sunny
4  1/5/2018           30          4  Sunny
5  1/6/2018           27          2   Snow

In [55]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,0,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,0,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,0,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,0,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,0,333

In [56]:
df.head(2)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,0,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,0,275

In [46]:
df3.tail()

        day  temperature  windspeed  event
1  1/2/2018           25          7   Snow
2  1/3/2017           32          2  Sunny
3  1/4/2018           29          7  Sunny
4  1/5/2018           30          4  Sunny
5  1/6/2018           27          2   Snow

In [57]:
df3.tail(2)

        day  temperature  windspeed  event
4  1/5/2018           30          4  Sunny
5  1/6/2018           27          2   Snow

In [47]:
df3[2:4]

        day  temperature  windspeed  event
2  1/3/2017           32          2  Sunny
3  1/4/2018           29          7  Sunny

In [48]:
df3[:4]

        day  temperature  windspeed  event
0  1/1/2018           22          6   Rain
1  1/2/2018           25          7   Snow
2  1/3/2017           32          2  Sunny
3  1/4/2018           29          7  Sunny

In [49]:
df3[2:]

        day  temperature  windspeed  event
2  1/3/2017           32          2  Sunny
3  1/4/2018           29          7  Sunny
4  1/5/2018           30          4  Sunny
5  1/6/2018           27          2   Snow

In [54]:
df3[:]

        day  temperature  windspeed  event
0  1/1/2018           22          6   Rain
1  1/2/2018           25          7   Snow
2  1/3/2017           32          2  Sunny
3  1/4/2018           29          7  Sunny
4  1/5/2018           30          4  Sunny
5  1/6/2018           27          2   Snow

In [51]:
df.shape

(31, 11)

In [52]:
df3.shape

(6, 4)

In [58]:
df3.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [61]:
df3["event"]

0     Rain
1     Snow
2    Sunny
3    Sunny
4    Sunny
5     Snow
Name: event, dtype: object

In [62]:
type(df3["day"])

pandas.core.series.Series

In [66]:
df3[["day", "temperature"]]

        day  temperature
0  1/1/2018           22
1  1/2/2018           25
2  1/3/2017           32
3  1/4/2018           29
4  1/5/2018           30
5  1/6/2018           27

In [67]:
df3[["day", "temperature", "event"]]

        day  temperature  event
0  1/1/2018           22   Rain
1  1/2/2018           25   Snow
2  1/3/2017           32  Sunny
3  1/4/2018           29  Sunny
4  1/5/2018           30  Sunny
5  1/6/2018           27   Snow

In [68]:
df3.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     27.500000   4.666667
std       3.619392   2.338090
min      22.000000   2.000000
25%      25.500000   2.500000
50%      28.000000   5.000000
75%      29.750000   6.750000
max      32.000000   7.000000

In [71]:
# Let's see how to select data based on specific condition:
# We want to print the tempereture which is higher than 29:
df3[df3.temperature > 29]

        day  temperature  windspeed  event
2  1/3/2017           32          2  Sunny
4  1/5/2018           30          4  Sunny

In [72]:
# Let's print only the row which has maximum temperature:
df3[df3.temperature == df3.temperature.max()]

        day  temperature  windspeed  event
2  1/3/2017           32          2  Sunny

In [73]:
# Or:
df3[df3.temperature==df3['temperature'].max()]

        day  temperature  windspeed  event
2  1/3/2017           32          2  Sunny

In [74]:
# To print only the day which has minimum temperature:
df3['day'][df3.temperature == df3.temperature.min()]

0    1/1/2018
Name: day, dtype: object

In [75]:
# Or:
df3['day'][df3.temperature == df3['temperature'].min()]

0    1/1/2018
Name: day, dtype: object

In [77]:
# We can also print other columns along with day:
df3[["day", "event"]][df3.temperature == df3.temperature.max()]

        day  event
2  1/3/2017  Sunny

In [90]:
# To check all the pandas operations, check 'Pandas Series Operation' in pandas documentation.

In [94]:
# Normally as we know our index is here default integer...
df3.index

RangeIndex(start=0, stop=6, step=1)

In [98]:
# We can change the default index to other one as we want:
df3.set_index('day', inplace=True)

In [99]:
df3

          temperature  windspeed  event
day
1/1/2018           22          6   Rain
1/2/2018           25          7   Snow
1/3/2017           32          2  Sunny
1/4/2018           29          7  Sunny
1/5/2018           30          4  Sunny
1/6/2018           27          2   Snow

In [107]:
# The advantage of changing the index is, now we can run loc() function, through loc() we can print all the terms based on specific day.
df3.loc[['1/4/2018']]

          temperature  windspeed  event
day
1/4/2018           29          7  Sunny

In [109]:
# We can reset the index to the previous state:
df3.reset_index(inplace=True)
df3

   index       day  temperature  windspeed  event
0      0  1/1/2018           22          6   Rain
1      1  1/2/2018           25          7   Snow
2      2  1/3/2017           32          2  Sunny
3      3  1/4/2018           29          7  Sunny
4      4  1/5/2018           30          4  Sunny
5      5  1/6/2018           27          2   Snow